HELLOWTO START 0                  IN THE BEGINNING...
         PRINT NOGEN              SPARE US THE MACRO EXPANSIONS
BEGIN    SAVE  (14,12)            SAVE INPUT REGISTERS
         LR    12,15              WHERE ARE WE?
         USING HELLOWTO,12        RIGHT HERE
         ST    13,SAVE+4          SAVE OLD SAVE AREA ADDRESS
         LA    11,SAVE            POINT TO NEW SAVE AREA
         ST    11,8(13)           IN OLD SAVE AREA
         LR    13,11              MOVE SAVE AREA ADDRESS
*
* NOW, WRITE "HELLO WORLD!" TO THE CONSOLE
*
DOWTO    EQU   *
         WTO   'HELLO, WORLD!'    WRITE THE MESSAGE
* COMMENT THE NEXT LINE IF YOU DON'T WANT THE OPERATOR TO COME AFTER
*   YOU WITH AN AXE
         B     DOWTO              AND DO IT AGAIN
*
* WE'RE DONE, EXIT CLEANLY
*
         L     13,SAVE+4          GET OLD SAVE AREA BACK
         RETURN (14,12),RC=0      TO THE OPERATING SYSTEM
*
* FILE AND WORK AREA DEFINITIONS
*
SAVE     DS    18F                LOCAL SAVE AREA
         END   BEGIN