HELLO    CSECT                                   
         USING HELLO,15                          
         SAVE (14,12)                            
         WTO 'HELLO WORLD COMPILED STEP BY STEP!'
         RETURN (14,12),RC=0                     
         END                                     