HELLOTSO START 0                  IN THE BEGINNING...
         PRINT NOGEN              SPARE US THE MACRO EXPANSIONS
BEGIN    SAVE  (14,12)            SAVE INPUT REGISTERS
         LR    12,15              WHERE ARE WE?
         USING HELLOTSO,12        RIGHT HERE
         ST    13,SAVE+4          SAVE OLD SAVE AREA ADDRESS
         LA    11,SAVE            POINT TO NEW SAVE AREA
         ST    11,8(13)           IN OLD SAVE AREA
         LR    13,11              MOVE SAVE AREA ADDRESS
*
* WRITE 'HELLO, WORLD!' TO THE TSO SESSION
*
DOTPUT   EQU   *
         TPUT  HELLOMSG,L'HELLOMSG,EDIT   SEND THE LINE
         B     DOTPUT             AND DO IT AGAIN
*
* THIS CODE WILL NEVER BE REACHED, BUT IS INCLUDED FOR COMPLETENESS
*
EXIT     L     13,SAVE+4          GET OLD SAVE AREA BACK
         RETURN (14,12),RC=(15)    QUIT
*
* FILE AND WORK AREA DEFINITIONS
*
SAVE     DS    18F                LOCAL SAVE AREA
HELLOMSG DC    C'HELLO, WORLD!'
         END   BEGIN