//COPY2SO JOB  CLASS=A,MSGCLASS=A,
//             MSGLEVEL=(1,1),REGION=256K
//STEP1   EXEC PGM=IEBGENER
//SYSUT1   DD  DISP=SHR,DSN=HERC01.IEBGENER.CNTL(XXX)
//SYSUT2   DD  SYSOUT=*
//SYSPRINT DD  SYSOUT=*
//SYSIN    DD  DUMMY
//
