//HERC01G   JOB  CLASS=A,MSGCLASS=G,MSGLEVEL=(1,1),REGION=256K,
//             NOTIFY=HERC01
//S1      EXEC PGM=IEBGENER
//SYSUT1   DD  *
Hello World
0C7
//SYSUT2   DD  SYSOUT=*
//SYSPRINT DD  SYSOUT=*
//SYSIN    DD  DUMMY
//
