//HERC01X   JOB  CLASS=A,MSGCLASS=X,MSGLEVEL=(1,1),REGION=256K,
//             NOTIFY=HERC01
//S1      EXEC PGM=IEBGENER
//SYSUT1   DD  *
Hello World
prt002.txt HELD
//SYSUT2   DD  SYSOUT=*
//SYSPRINT DD  SYSOUT=*
//SYSIN    DD  DUMMY
//
