//HERC01A JOB  CLASS=A,MSGCLASS=B,MSGLEVEL=(1,1),REGION=256K,
//             NOTIFY=HERC01
//S1      EXEC PGM=IEBGENER
//SYSUT1   DD  *
Hello World
pch00d.txt
//SYSUT2   DD  SYSOUT=*
//SYSPRINT DD  SYSOUT=*
//SYSIN    DD  DUMMY
//
