//HERC01Z   JOB  CLASS=A,MSGCLASS=Z,MSGLEVEL=(1,1),REGION=256K,
//             NOTIFY=HERC01
//S1      EXEC PGM=IEBGENER
//SYSUT1   DD  *
Hello World
prt00f.txt
//SYSUT2   DD  SYSOUT=*
//SYSPRINT DD  SYSOUT=*
//SYSIN    DD  DUMMY
//
