//RECVPDS JOB 'DEMO DSORG=PO',CLASS=A,MSGCLASS=A
//RECV370 EXEC PGM=RECV370P
//STEPLIB DD DSN=SYS2.LINKLIB,DISP=SHR
//RECVLOG DD SYSOUT=*
//XMITIN DD *
<insert XMIT file here>
//SYSPRINT DD SYSOUT=*
//SYSUT1 DD DSN=&&SYSUT1,
// UNIT=SYSDA,
// SPACE=(CYL,(5,1)),
// DISP=(,DELETE,DELETE)
//SYSUT2 DD DSN=SYS2.RECV370.DEMO.PDS,
// UNIT=3380,VOL=SER=MVS809,
// SPACE=(CYL,(5,1,45),RLSE),
// DISP=(,CATLG,DELETE)
//SYSIN DD DUMMY
//SYSUDUMP DD SYSOUT=*
//