//GETRID   JOB  CLASS=A,MSGCLASS=A,REGION=256K,MSGLEVEL=(1,1)
//DELETE   EXEC PGM=IEFBR14
//GETRID1   DD  DISP=(MOD,DELETE,DELETE),DSN=HERC01.XXX.CNTL,
//     UNIT=SYSDA,SPACE=(TRK,(0))
//GETRID2   DD  DISP=(MOD,DELETE,DELETE),DSN=HERC01.XXX.CNTL.XXX,
//     UNIT=SYSDA,SPACE=(TRK,(0))
//GETRID3   DD  DISP=(MOD,DELETE,DELETE),DSN=HERC01.YYY.CNTL,
//     UNIT=SYSDA,SPACE=(TRK,(0))
//
