//RESTORE  JOB  CLASS=A,MSGLEVEL=(1,1),MSGCLASS=A,
//             USER=HERC01,PASSWORD=CUL8TR
//STEP1    EXEC PGM=IEHDASDR
//SYSPRINT  DD  SYSOUT=*
//TAPE      DD  DSN=TAPE,VOL=SER=000010,UNIT=480,DISP=OLD
//DISK      DD  UNIT=3350,VOL=SER=TEST01,DISP=(OLD,CATLG,CATLG)
//SYSIN     DD  *
   RESTORE FROMDD=TAPE,TODD=DISK,PURGE=YES
/*
//
