//DUMP2SP  JOB  CLASS=A,MSGLEVEL=(1,1),MSGCLASS=A
//STEP1    EXEC PGM=IEHDASDR
//SYSPRINT  DD  SYSOUT=*
//DISK      DD  UNIT=3350,VOL=SER=PUB000,DISP=SHR
//SYSIN     DD  *
   DUMP FROMDD=DISK,TODD=SYSPRINT,BEGIN=00000000,END=00000001
/*
//
