/*
/* IEF621I EXPECTED CONTINUATION NOT RECEIVED:
/* //DUMP2TP  JOB  CLASS=A,MSGLEVEL=(1,1),MSGCLASS=A,
/* //              USER=HERC01,PASSWORD=CUL8TR
/*
//DUMP2TP  JOB  CLASS=A,MSGCLASS=A,USER=HERC01,PASSWORD=CUL8TR
//IEHDASDR EXEC PGM=IEHDASDR,REGION=4096K
//SYSPRINT  DD  SYSOUT=*
//DISK      DD  UNIT=SYSDA,VOL=SER=TEST00,DISP=SHR
//TAPE      DD  DSN=TAPE,VOL=SER=000012,UNIT=(480,,DEFER),
//             DISP=(NEW,CATLG)
//SYSIN     DD  *
               DUMP FROMDD=DISK,TODD=TAPE
/*
//
