//LISTCAT  JOB CLASS=A,MSGLEVEL=(1,1)
//LISTCAT  EXEC PGM=IDCAMS,REGION=4096K
//SYSPRINT DD  SYSOUT=A
//SYSIN    DD  *
  DELETE 'HERC01.XXX.CNTL'
/*
//
