//VTOCLIST JOB 'JAY MOSELEY',CLASS=A,MSGLEVEL=(1,1)
//LIST     EXEC PGM=VTOCLIST
//SYSPRINT DD  SYSOUT=A,DCB=(RECFM=VBA,LRECL=125,BLKSIZE=1254)
//SYSUT1   DD  UNIT=SYSALLDA,DISP=OLD,VOL=SER=PUB000
//
