//INIT     JOB  CLASS=A,MSGCLASS=A
//ICKDSF   EXEC PGM=ICKDSF,REGION=4096K
//SYSPRINT  DD  SYSOUT=*
//SYSIN     DD  *
  INIT UNITADDRESS(330) NOVERIFY VOLID(TEST00) OWNER(HERCULES) -
               VTOC(0,1,15) PURGE
/*
//
