//INIT     JOB  CLASS=A,MSGCLASS=A,USER=HERC01,PASSWORD=CUL8TR
//ICKDSF   EXEC PGM=ICKDSF,REGION=4096K
//SYSPRINT  DD  SYSOUT=*
//SYSIN     DD  *
  INIT UNITADDRESS(340) NOVERIFY VOLID(TEST01) OWNER(HERCULES) -
               VTOC(0,1,15) PURGE
/*
//
