//NEWFILE JOB  CLASS=A,MSGCLASS=A,REGION=256K,MSGLEVEL=(1,1)
//ALLOC   EXEC PGM=IEFBR14
//NEWFILE1 DD  DISP=(NEW,CATLG),DSN=HERC01.YYY.CNTL,
//             UNIT=3350,VOL=SER=PUB000,
//             SPACE=(CYL,(10,10,10)),DCB=SYS1.PARMLIB
//
