*************** NOT WORKING ***************
//VOLINIT JOB   CLASS=A,MSGCLASS=A
//STEP1   EXEC  PGM=IEHDASDR
//SYSPRINT DD   SYSOUT=*
//DISK DD UNIT=3350,VOL=SER=TEST01,DISP=OLD
//SYSIN    DD   *
   ANALYZE TODD=3350,VTOC=1,EXTENT=5,NEWVOLID=TEST01,PURGE=YES
/*
//