*************** NOT WORKING ***************
//INIT     JOB  CLASS=A,MSGCLASS=A
//ICKDSF   EXEC PGM=ICKDSF13,REGION=4096K
//SYSPRINT  DD  SYSOUT=*
//SYSIN     DD  *
  INIT UNITADDRESS(390) NOVERIFY VOLID(TEST02) OWNER(HERCULES) -
               VTOC(0,1,15) PURGE
/*
//