//COPY    JOB  CLASS=A,MSGCLASS=A,
//             MSGLEVEL=(1,1),REGION=256K,
//             USER=HERC01,PASSWORD=CUL8TR
//STEP1   EXEC PGM=IEBCOPY
//FROM1    DD  DSN=HERC01.CBT.CNTL,UNIT=SYSDA,VOL=SER=PUB000,
//            DISP=OLD
//TO1      DD  DSN=TAPE,VOL=SER=000009,UNIT=(480,,DEFER),
//            DISP=(NEW,CATLG)
//SYSUT3   DD  UNIT=SYSDA,SPACE=(TRK,5)
//SYSUT4   DD  UNIT=SYSDA,SPACE=(TRK,5)
//SYSPRINT DD  SYSOUT=A
//SYSIN    DD  *
   COPY INDD=FROM1,OUTDD=TO1
/*
//
